#include <iostream>

int main() {
    const int MAX_SIZE = 100; // Максимальний розмір масиву
    int A[MAX_SIZE];          // Масив
    int N, K;

    // Введення розміру масиву
    std::cout << "Введіть розмір масиву (N): ";
    std::cin >> N;

    // Введення елементів масиву
    std::cout << "Введіть елементи масиву:\n";
    for (int i = 0; i < N; ++i) {
        std::cout << "A[" << i << "]: ";
        std::cin >> A[i];
    }

    // Введення значення K
    std::cout << "Введіть значення K: ";
    std::cin >> K;

    // Виведення елементів масиву з порядковими номерами, кратними K
    std::cout << "Елементи масиву з порядковими номерами, кратними K:\n";
    for (int i = K - 1; i < N; i += K) {
        std::cout << A[i] << " ";
    }

    return 0;
}
